docs/0004-modeling-irs.md
```mermaid
classDiagram
  direction BT
  class constant_prisoner_outcome {
    integer sequence
    varchar(60) description
    varchar(60) code
  }
  class constant_prisoner_role {
    integer sequence
    varchar(60) description
    varchar(60) code
  }
  class constant_staff_role {
    integer sequence
    varchar(60) description
    varchar(60) code
  }
  class constant_status {
    integer sequence
    varchar(60) description
    varchar(255) definition
    boolean ignore_downstream
    varchar(60) code
  }
  class constant_type {
    integer sequence
    varchar(60) description
    boolean active
    varchar(60) family_code
    varchar(60) code
  }
  class constant_type_family {
    integer sequence
    varchar(60) description
    varchar(60) code
  }
  class constant_user_action {
    integer sequence
    varchar(60) description
    varchar(60) code
  }
  class constant_user_type {
    integer sequence
    varchar(60) description
    varchar(60) code
  }
  class correction_request {
    uuid report_id
    text description_of_change
    timestamp correction_requested_at
    varchar(120) correction_requested_by
    integer sequence
    varchar(20) location
    varchar(60) user_action
    varchar(25) original_report_reference
    varchar(60) user_type
    integer id
  }
  class description_addendum {
    uuid report_id
    integer sequence
    text text
    timestamp created_at
    varchar(120) created_by
    varchar(255) first_name
    varchar(255) last_name
    integer id
  }
  class historical_question {
    integer history_id
    integer sequence
    varchar(60) code
    text question
    text additional_information
    text label
    integer id
  }
  class historical_response {
    integer historical_question_id
    integer sequence
    text response
    date response_date
    text additional_information
    timestamp recorded_at
    varchar(120) recorded_by
    varchar(60) code
    text label
    integer id
  }
  class history {
    uuid report_id
    varchar(60) type
    timestamp changed_at
    varchar(120) changed_by
    integer id
  }
  class prisoner_involvement {
    uuid report_id
    varchar(7) prisoner_number
    varchar(60) prisoner_role
    varchar(60) outcome
    text comment
    integer sequence
    varchar(255) first_name
    varchar(255) last_name
    integer id
  }
  class question {
    uuid report_id
    integer sequence
    varchar(60) code
    text question
    text additional_information
    text label
    integer id
  }
  class report {
    varchar(25) report_reference
    varchar(255) title
    text description
    varchar(20) location
    varchar(60) type
    varchar(5) source
    varchar(60) status
    timestamp incident_date_and_time
    timestamp reported_at
    varchar(120) reported_by
    varchar(20) question_set_id
    timestamp created_at
    varchar(120) modified_by
    timestamp modified_at
    varchar(5) modified_in
    boolean staff_involvement_done
    boolean prisoner_involvement_done
    uuid duplicated_report_id
    uuid id
  }
  class response {
    integer question_id
    integer sequence
    text response
    date response_date
    text additional_information
    timestamp recorded_at
    varchar(120) recorded_by
    varchar(60) code
    text label
    integer id
  }
  class staff_involvement {
    uuid report_id
    varchar(120) staff_username
    varchar(60) staff_role
    text comment
    integer sequence
    varchar(255) first_name
    varchar(255) last_name
    integer id
  }
  class status_history {
    uuid report_id
    varchar(60) status
    timestamp changed_at
    varchar(120) changed_by
    integer id
  }

  correction_request --> report: report_id
  description_addendum --> report: report_id
  historical_question --> history: history_id
  historical_response --> historical_question: historical_question_id
  history --> report: report_id
  prisoner_involvement --> report: report_id
  question --> report: report_id
  report --> report: duplicated_report_id
  response --> question: question_id
  staff_involvement --> report: report_id
  status_history --> report: report_id
```
